Sanghyun-Hong/Scorpion-IPA/Libraries/BSP/STM32F429I-Discovery/stm32f429i_discovery_camera.h
/**
  ******************************************************************************
  * @file    stm32f429i_discovery_camera.h
  * @author  MCD Application Team
  * @version V2.0.3
  * @date    10-December-2014
  * @brief   This file contains the common defines and functions prototypes for
  *          the stm32f429i_discovery_camera.c driver.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2014 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */ 

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32F429I_DISCOVERY_CAMERA_H
#define __STM32F429I_DISCOVERY_CAMERA_H

#ifdef __cplusplus
 extern "C" {
#endif 

/* Includes ------------------------------------------------------------------*/
#include "stm32f429i_discovery.h"
   
/* Include Camera component Driver */
#include "../Components/mt9m111/mt9m111.h"

/* Include uart debug function */
extern HAL_StatusTypeDef UB_UART_Debug(uint8_t * str, uint16_t len);
   
/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32F429I_DISCOVERY
  * @{
  */
    
/** @addtogroup STM32F429I_DISCOVERY_CAMERA
  * @{
  */ 
/* Enabling the camera power control feature */    
#ifndef CAMERA_POWER_CONTROL
// #define CAMERA_POWER_CONTROL
#endif
/**
  * @}
  */ 
    
/** @addtogroup STM32F429I_DISCOVERY_CAMERA_LOW_LEVEL_CAMERA
  * @{
  */ 
#ifdef  CAMERA_POWER_CONTROL    
  #define POWER_PIN                               GPIO_PIN_1
  #define POWER_GPIO_PORT                         GPIOA
  #define POWER_GPIO_CLK_ENABLE()                 __GPIOA_CLK_ENABLE()  
  #define POWER_GPIO_CLK_DISABLE()                __GPIOA_CLK_DISABLE()  
  
  #define STANDBY_PIN                             GPIO_PIN_3
  #define STANDBY_GPIO_PORT                       GPIOA
  #define STANDBY_GPIO_CLK_ENABLE()               __GPIOA_CLK_ENABLE()  
  #define STANDBY_GPIO_CLK_DISABLE()              __GPIOA_CLK_DISABLE()  

  #define CS_PIN                                  GPIO_PIN_5
  #define CS_GPIO_PORT                            GPIOA
  #define CS_GPIO_CLK_ENABLE()                    __GPIOA_CLK_ENABLE()  
  #define CS_GPIO_CLK_DISABLE()                   __GPIOA_CLK_DISABLE()  
#endif
/**
  * @}
  */ 

/** @defgroup STM32F429I_DISCOVERY_CAMERA_Exported_Types
  * @{
  */

/** 
  * @brief  Camera State structures definition  
  */  
typedef enum 
{
  CAMERA_OK       = 0x00,
  CAMERA_ERROR    = 0x01,
  CAMERA_TIMEOUT  = 0x02 
} Camera_StatusTypeDef;

#define RESOLUTION_R160x120      CAMERA_R160x120      /* QQVGA Resolution     */
#define RESOLUTION_R320x240      CAMERA_R320x240      /* QVGA Resolution      */
#define RESOLUTION_R480x272      CAMERA_R480x272      /* 480x272 Resolution   */
#define RESOLUTION_R640x480      CAMERA_R640x480      /* VGA Resolution       */  
/**
  * @}
  */ 
 
/** @defgroup STM32F4_DISCOVERY_CAMERA_Exported_Constants
  * @{
  */

/** @defgroup STM32F429I_DISCOVERY_CAMERA_Exported_Functions
  * @{
  */
/* Camera setup functions */
void            BSP_CAMERA_Init(void);
#ifdef  CAMERA_POWER_CONTROL
  void            BSP_CAMERA_PowerOn(void);
  void            BSP_CAMERA_PowerOff(void);
  void            BSP_CAMERA_Standby(void);
  void            BSP_CAMERA_WakeUp(void);
  uint8_t         BSP_CAMERA_IsOn(void);
  uint8_t         BSP_CAMERA_IsAwake(void);
  void            BSP_CAMERA_EnableOutput(void);
  void            BSP_CAMERA_DisableOutput(void);
#endif
/* Camera control functions */
uint16_t        BSP_CAMERA_GetVersion(void);
void            BSP_CAMERA_SnapshotStart(uint8_t *buff);
void            BSP_CAMERA_ContinuousStart(uint8_t *buff);
void            BSP_CAMERA_Suspend(void);
void            BSP_CAMERA_Resume(void);
uint8_t         BSP_CAMERA_Stop(void);
/* DCMI event callback functions */
void            BSP_CAMERA_LineEventCallback(void);
void            BSP_CAMERA_VsyncEventCallback(void);
void            BSP_CAMERA_FrameEventCallback(void);
void            BSP_CAMERA_ErrorCallback(void);
/* To be called in DCMI_IRQHandler function */
void            BSP_CAMERA_IRQHandler(void);
/* To be called in DMA2_Stream1_IRQHandler function */
void            BSP_CAMERA_DMA_IRQHandler(void);

/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __STM32F429I_DISCOVERY_CAMERA_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
